Update article, enable mermaid dark theme
